tieutuanbao/mcu_xlibs/arch/arm/geehy/apm32f003x4x6/libs/source/apm32f00x_tmr2.c
/*!
 * @file        apm32f00x_tmr2.c
 *
 * @brief       This file contains all the functions for the Timer2 peripheral
 *
 * @version     V1.0.1
 *
 * @date        2022-04-11
 *
 * @attention
 *
 *  Copyright (C) 2018-2022 Geehy Semiconductor
 *
 *  You may not use this file except in compliance with the
 *  GEEHY COPYRIGHT NOTICE (GEEHY SOFTWARE PACKAGE LICENSE).
 *
 *  The program is only for reference, which is distributed in the hope
 *  that it will be usefull and instructional for customers to develop
 *  their software. Unless required by applicable law or agreed to in
 *  writing, the program is distributed on an "AS IS" BASIS, WITHOUT
 *  ANY WARRANTY OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the GEEHY SOFTWARE PACKAGE LICENSE for the governing permissions
 *  and limitations under the License.
 */
#include "apm32f00x_tmr2.h"

/** @addtogroup Peripherals_Library Standard Peripheral Library
  @{
*/

/** @addtogroup TMR2_Driver TMR2 Driver
  @{
*/

/** @addtogroup TMR2_Fuctions Fuctions
  @{
*/

/*!
 * @brief       Set the timer2 peripheral registers to their default reset values.
 *
 * @param       None
 *
 * @retval      None
 *
 * @note
 */
void TMR2_Reset(void)
{
    TMR2->CTRL1 = TMR2_CTRL1_RESET_VALUE;
    TMR2->CTRL2 = TMR2_CTRL2_RESET_VALUE;

    TMR2->SMC = TMR2_SMC_RESET_VALUE;
    TMR2->INTCTRL = TMR2_INTCTRL_RESET_VALUE;
    TMR2->STS2 = TMR2_STS2_RESET_VALUE;

    /* Disable channels */
    TMR2->CHCTRL1 = TMR2_CHCTRL1_RESET_VALUE;
    TMR2->CHCTRL2 = TMR2_CHCTRL2_RESET_VALUE;

    /* Configure channels as inputs: it is necessary if lock level is equal to 2 or 3 */
    TMR2->CH1CCM = 1;
    TMR2->CH2CCM = 1;
    TMR2->CH3CCM = 1;

    /* Then reset channel registers: it also works if lock level is equal to 2 or 3 */
    TMR2->CHCTRL1 = TMR2_CHCTRL1_RESET_VALUE;
    TMR2->CHCTRL2 = TMR2_CHCTRL2_RESET_VALUE;
    TMR2->CH1CCM = TMR2_CH1CCM_RESET_VALUE;
    TMR2->CH2CCM = TMR2_CH2CCM_RESET_VALUE;
    TMR2->CH3CCM = TMR2_CH3CCM_RESET_VALUE;
    TMR2->CNT1 = TMR2_CNT1_RESET_VALUE;
    TMR2->CNT0 = TMR2_CNT0_RESET_VALUE;
    TMR2->PSC = TMR2_DIV_RESET_VALUE;
    TMR2->AUTORLD1 = TMR2_AURLD1_RESET_VALUE;
    TMR2->AUTORLD0 = TMR2_AURLD0_RESET_VALUE;
    TMR2->CH1CC1 = TMR2_CH1CC1_RESET_VALUE;
    TMR2->CH1CC0 = TMR2_CH1CC0_RESET_VALUE;
    TMR2->CH2CC1 = TMR2_CH2CC1_RESET_VALUE;
    TMR2->CH2CC0 = TMR2_CH2CC0_RESET_VALUE;
    TMR2->CH3CC1 = TMR2_CH3CC1_RESET_VALUE;
    TMR2->CH3CC0 = TMR2_CH3CC0_RESET_VALUE;

    TMR2->STS1 = TMR2_STS1_RESET_VALUE;
}

/*!
 * @brief       Initializes the Timer2 Time Base Unit according to the specified parameters
 *
 * @param       divider:    clock divider value
 *
 * @param       count:      specifies the counter
 *
 * @retval      None
 *
 * @note
 */
void TMR2_ConfigTimerBase(uint8_t divider, uint16_t count)
{
    /** Set the auto reload value */
    TMR2->AUTORLD1 = (uint32_t)(count >> 8) & 0xff;
    TMR2->AUTORLD0 = (uint32_t)(count & 0xff);

    /** set divide number */
    TMR2->PSC = (uint32_t)divider;

    TMR2->SCEG_B.UEG = BIT_SET;
}

/*!
 * @brief       Initializes the Timer2 Channel1 Output Compare according to the specified parameters
 *
 * @param       ocConfigStruct: pointer to a TMR2_OCConfig_T structure that
 *                              contains the configuration information for Timer2 peripheral
 *
 * @retval      None
 *
 * @note
 */
void TMR2_ConfigOutputComare1(TMR2_OCConfig_T * ocConfigStruct)
{
    /** OCx ploarity */
    TMR2->CHCTRL1_B.CH1CCP = ocConfigStruct->OCxPolarity;

    /** OCx output Enable/Disable */
    TMR2->CHCTRL1_B.CH1CCEN = ocConfigStruct->OCxOutputState;

    /** compare mode */
    TMR2->CH1OC_B.OCMS = ocConfigStruct->mode;

    /** compare data */
    TMR2->CH1CC1 = (uint32_t)(ocConfigStruct->count >> 8) & 0xff;
    TMR2->CH1CC0 = (uint32_t)(ocConfigStruct->count) & 0xff;
}

/*!
 * @brief       Initializes the Timer2 Channel2 Output Compare according to the specified parameters
 *
 * @param       ocConfigStruct: pointer to a TMR2_OCConfig_T structure that
 *                              contains the configuration information for Timer2 peripheral
 *
 * @retval      None
 *
 * @note
 */
void TMR2_ConfigOutputComare2(TMR2_OCConfig_T * ocConfigStruct)
{
    /** OCx ploarity */
    TMR2->CHCTRL1_B.CH2CCP = ocConfigStruct->OCxPolarity;

    /** OCx output Enable/Disable */
    TMR2->CHCTRL1_B.CH2CCEN = ocConfigStruct->OCxOutputState;

    /** compare mode */
    TMR2->CH2OC_B.OCMS = ocConfigStruct->mode;

    /** compare data */
    TMR2->CH2CC1 = (uint32_t)(ocConfigStruct->count >> 8) & 0xff;
    TMR2->CH2CC0 = (uint32_t)(ocConfigStruct->count) & 0xff;
}

/*!
 * @brief       Initializes the Timer2 Channel3 Output Compare according to the specified parameters
 *
 * @param       ocConfigStruct: pointer to a TMR2_OCConfig_T structure that
 *                              contains the configuration information for Timer2 peripheral
 *
 * @retval      None
 *
 * @note
 */

void TMR2_ConfigOutputComare3(TMR2_OCConfig_T * ocConfigStruct)
{
    /** OCx ploarity */
    TMR2->CHCTRL2_B.CH3CCP = ocConfigStruct->OCxPolarity;

    /** OCx output Enable/Disable */
    TMR2->CHCTRL2_B.CH3CCEN = ocConfigStruct->OCxOutputState;

    /** compare mode */
    TMR2->CH3OC_B.OCMS = ocConfigStruct->mode;

    /** compare data */
    TMR2->CH3CC1 = (uint32_t)(ocConfigStruct->count >> 8) & 0xff;
    TMR2->CH3CC0 = (uint32_t)(ocConfigStruct->count) & 0xff;
}

/*!
 * @brief       Initializes the Timer2 Output Compare according to the specified parameters
 *
 * @param       ocConfigStruct: pointer to a TMR2_OCConfig_T structure that
 *                              contains the configuration information for Timer2 peripheral
 *
 * @retval      None
 *
 * @note
 */
void TMR2_ConfigOutputCompare(TMR2_OCConfig_T * ocConfigStruct)
{
    if(ocConfigStruct->channel & TMR2_CHANNEL_1)
    {
        TMR2_ConfigOutputComare1(ocConfigStruct);
    }

    if(ocConfigStruct->channel & TMR2_CHANNEL_2)
    {
        TMR2_ConfigOutputComare2(ocConfigStruct);
    }

    if(ocConfigStruct->channel & TMR2_CHANNEL_3)
    {
        TMR2_ConfigOutputComare3(ocConfigStruct);
    }
}

/*!
 * @brief       Fills each ocConfigStruct member with its default value
 *
 * @param       ocConfigStruct: Pointer to a TMR2_OCConfig_T structure which will be initialized
 *
 * @retval      None
 *
 * @note
 */
void TMR2_OCStructInit(TMR2_OCConfig_T *ocConfigStruct)
{
    ocConfigStruct->channel = TMR2_CHANNEL_1;
    ocConfigStruct->count = 0xffff;
    ocConfigStruct->mode = TMR2_OC_MODE_TIMING;
    ocConfigStruct->OCxOutputState = TMR2_OC_OUTPUT_DISABLE;
    ocConfigStruct->OCxPolarity = TMR2_OC_POLARITY_HIGH;
}

/*!
 * @brief       Output compare mode configuration
 *
 * @param       channel:    Timer channel.
 *                          This parameter can be any combination of the following values:
 *                          @arg TMR2_CHANNEL_1: Channel 1
 *                          @arg TMR2_CHANNEL_2: Channel 2
 *                          @arg TMR2_CHANNEL_3: Channel 3
 *
 * @param       mode:       Output compare mode.
 *
 * @retval      None
 *
 * @note
 */
void TMR2_ConfigOutputCompareMode(uint8_t channel, TMR2_OC_MODE_T mode)
{
    if(channel & TMR2_CHANNEL_1)
    {
        TMR2->CH1OC_B.OCMS = mode;
    }

    if(channel & TMR2_CHANNEL_2)
    {
        TMR2->CH2OC_B.OCMS = mode;
    }

    if(channel & TMR2_CHANNEL_3)
    {
        TMR2->CH3OC_B.OCMS = mode;
    }
}

/*!
 * @brief        Initializes the Timer2 Channel 1 Input Capture according to the specified parameters
 *
 * @param        polarity:  Input capture polarity.
 *
 * @param        selection: Input capture source selection.
 *
 * @param        div:       Input capture divider number.
 *
 * @param        filter:    Input capture filter.
 *
 * @retval       None
 *
 * @note
 */
void TMR2_ConfigInputCapture1(TMR2_IC_POLARITY_T polarity, TMR2_IC_SELECT_T selection,
                                        TMR2_IC_DIV_T div, uint8_t filter)
{
    /** input capture selection */
    TMR2->CH1IC_B.MODESEL = selection;

    /** filter set */
    TMR2->CH1IC_B.ICFC = filter & 0X0F;

    /** input capture divider */
    TMR2->CH1IC_B.IC1PSC = div;

    /** input polarity */
    TMR2->CHCTRL1_B.CH1CCP = polarity;

    /** Enable input */
    TMR2->CHCTRL1_B.CH1CCEN = ENABLE;
}

/*!
 * @brief        Initializes the Timer2 Channel 2 Input Capture according to the specified parameters
 *
 * @param        polarity:  Input capture polarity.
 *
 * @param        selection: Input capture source selection.
 *
 * @param        div:       Input capture divider number.
 *
 * @param        filter:    Input capture filter.
 *
 * @retval       None
 *
 * @note
 */
void TMR2_ConfigInputCapture2(TMR2_IC_POLARITY_T polarity, TMR2_IC_SELECT_T selection,
                                        TMR2_IC_DIV_T div, uint8_t filter)
{
    /** input capture selection */
    TMR2->CH2IC_B.MODESEL = selection;

    /** filter set */
    TMR2->CH2IC_B.ICFC = filter;

    /** input capture divider */
    TMR2->CH2IC_B.IC2PSC = div;

    /** input polarity */
    TMR2->CHCTRL1_B.CH2CCP = polarity;

    /** Enable input */
    TMR2->CHCTRL1_B.CH2CCEN = ENABLE;
}

/*!
 * @brief        Initializes the Timer2 Channel 3 Input Capture according to the specified parameters
 *
 * @param        polarity:  Input capture polarity.
 *
 * @param        selection: Input capture source selection.
 *
 * @param        div:       Input capture divider number.
 *
 * @param        filter:    Input capture filter.
 *
 * @retval       None
 *
 * @note
 */
void TMR2_ConfigInputCapture3(TMR2_IC_POLARITY_T polarity, TMR2_IC_SELECT_T selection,
                                        TMR2_IC_DIV_T div, uint8_t filter)
{
    /** input capture selection */
    TMR2->CH3IC_B.MODESEL = selection;

    /** filter set */
    TMR2->CH3IC_B.ICFC = filter;

    /** input capture divider */
    TMR2->CH3IC_B.IC3PSC = div;

    /** input polarity */
    TMR2->CHCTRL2_B.CH3CCP = polarity;

    /** Enable input */
    TMR2->CHCTRL2_B.CH3CCEN = ENABLE;
}

/*!
 * @brief       Initializes the Timer2  peripheral according to the specified parameters
 *
 * @param       icConfigStruct: pointer to a TMR2_ICConfig_T structure that
 *                              contains the configuration information for the specified Timer peripheral
 *
 * @retval      None
 *
 * @note
 */
void TMR2_ConfigInputCapture(TMR2_ICConfig_T *icConfigStruct)
{
    if(icConfigStruct->channel & TMR2_CHANNEL_1)
    {
        TMR2_ConfigInputCapture1(icConfigStruct->polarity, icConfigStruct->selection,
                                icConfigStruct->div, icConfigStruct->filter);
    }

    if(icConfigStruct->channel & TMR2_CHANNEL_2)
    {
        TMR2_ConfigInputCapture2(icConfigStruct->polarity, icConfigStruct->selection,
                                icConfigStruct->div, icConfigStruct->filter);
    }

    if(icConfigStruct->channel & TMR2_CHANNEL_3)
    {
        TMR2_ConfigInputCapture3(icConfigStruct->polarity, icConfigStruct->selection,
                                icConfigStruct->div, icConfigStruct->filter);
    }
}

/*!
 * @brief       Fills each icConfigStruct member with its default value
 *
 * @param       icConfigStruct: Pointer to a TMR2_ICConfig_T structure which will be initialized
 *
 * @retval      None
 *
 * @note
 */
void TMR2_ICStructInit(TMR2_ICConfig_T *icConfigStruct)
{
    icConfigStruct->channel = TMR2_CHANNEL_1;
    icConfigStruct->div = TMR2_IC_DIV_1;
    icConfigStruct->filter = 0;
    icConfigStruct->polarity = TMR2_IC_POLARITY_RISING;
    icConfigStruct->selection = TMR2_IC_SELECT_DIRECTTI;
}

/*!
 * @brief       Configures the TIM1 peripheral PWM Input Mode according to the specified parameters
 *
 * @param       pwmInputConfig: pointer to a TMR2_ICConfig_T structure that
 *                              contains the configuration information for the specified Timer peripheral
 *
 * @retval      None
 *
 * @note
 */
void TMR2_ConfigInputPWM(TMR2_ICConfig_T *pwmInputConfig)
{
    TMR2_IC_POLARITY_T polarityCHxN = TMR2_IC_POLARITY_RISING;
    TMR2_IC_SELECT_T selectionCHxN = TMR2_IC_SELECT_DIRECTTI;

    if(pwmInputConfig->polarity == TMR2_IC_POLARITY_RISING)
    {
        polarityCHxN = TMR2_IC_POLARITY_FALLING;
    }

    if(pwmInputConfig->selection == TMR2_IC_SELECT_DIRECTTI)
    {
        selectionCHxN = TMR2_IC_SELECT_INDIRECTTI;
    }

    if(pwmInputConfig->channel == TMR2_CHANNEL_1)
    {
        TMR2_ConfigInputCapture1(pwmInputConfig->polarity, pwmInputConfig->selection,
                                pwmInputConfig->div, pwmInputConfig->filter);

