tieutuanbao/mcu_xlibs/arch/arm/geehy/apm32f003x4x6/libs/source/apm32f00x_tmr2.c
        TMR2_ConfigInputCapture2(polarityCHxN, selectionCHxN,
                                pwmInputConfig->div, pwmInputConfig->filter);
    }
    else if(pwmInputConfig->channel == TMR2_CHANNEL_2)
    {
        TMR2_ConfigInputCapture2(pwmInputConfig->polarity, pwmInputConfig->selection,
                                pwmInputConfig->div, pwmInputConfig->filter);

        TMR2_ConfigInputCapture1(polarityCHxN, selectionCHxN,
                                pwmInputConfig->div, pwmInputConfig->filter);
    }
}

/*!
 * @brief       Enable Timer2
 *
 * @param       None
 *
 * @retval      None
 *
 * @note
 */
void TMR2_Enable(void)
{
    TMR2->CTRL1_B.CNTEN = BIT_SET;
}

/*!
 * @brief       Disable Timer2
 *
 * @param       None
 *
 * @retval      None
 *
 * @note
 */
void TMR2_Disable(void)
{
    TMR2->CTRL1_B.CNTEN = BIT_RESET;
}

/*!
 * @brief       Enable interrupt
 *
 * @param       interrupt:  Interrupt source.
 *                          This parameter can be any combination of the following values:
 *                          @arg TMR2_INT_UPDATE:   Update interrupt
 *                          @arg TMR2_INT_CH1CC:    Channel 1 Compare/Capture interrupt
 *                          @arg TMR2_INT_CH2CC:    Channel 2 Compare/Capture interrupt
 *                          @arg TMR2_INT_CH3CC:    Channel 3 Compare/Capture interrupt
 *                          @arg TMR2_INT_TRIGGER:  Trigger interrupt
 * @retval      None
 *
 * @note
 */
void TMR2_EnableInterrupt(uint8_t interrupt)
{
    TMR2->INTCTRL |= (uint32_t)interrupt;
}

/*!
 * @brief       Disable interrupt
 *
 * @param       interrupt:  Interrupt source.
 *                          This parameter can be any combination of the following values:
 *                          @arg TMR2_INT_UPDATE:   Update interrupt
 *                          @arg TMR2_INT_CH1CC:    Channel 1 Compare/Capture interrupt
 *                          @arg TMR2_INT_CH2CC:    Channel 2 Compare/Capture interrupt
 *                          @arg TMR2_INT_CH3CC:    Channel 3 Compare/Capture interrupt
 *                          @arg TMR2_INT_TRIGGER:  Trigger interrupt
 * @retval      None
 *
 * @note
 */
void TMR2_DisableInterrupt(uint8_t interrupt)
{
    TMR2->INTCTRL &= (uint32_t)~interrupt;
}

/*!
 * @brief       Set divider
 *
 * @param       divider:   divider
 *
 * @retval      None
 *
 * @note
 */
void TMR2_SetDivider(uint8_t divider)
{
    TMR2->PSC = (uint32_t)(divider & 0x0f);
}

/*!
 * @brief       Input Trigger Configuration
 *
 * @param       trigger:    Input Trigger selection
 *
 * @retval      None
 *
 * @note
 */
void TMR2_ConfigInputTrigger(TMR2_ITC_T trigger)
{
    TMR2->SMC_B.ITC = trigger;
}

/*!
 * @brief       Enable Auto-reload buffer(preloaded)
 *
 * @param       None
 *
 * @retval      None
 *
 * @note
 */
void TMR2_EnableAutoReloadBuffer(void)
{
    TMR2->CTRL1_B.ARBEN = BIT_SET;
}

/*!
 * @brief       Disable Auto-reload buffer(preloaded)
 *
 * @param       None
 *
 * @retval      None
 *
 * @note
 */
void TMR2_DisableAutoReloadBuffer(void)
{
    TMR2->CTRL1_B.ARBEN = BIT_RESET;
}

/*!
 * @brief       Enable Specified Channel output compare buffer(preload)
 *
 * @param       tmr:        Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       channel:    Timer Channel
 *                          The Parameter can be combination of the following values:
 *                          @arg TMR2_CHANNEL_1:    Channel 1
 *                          @arg TMR2_CHANNEL_2:    Channel 2
 *                          @arg TMR2_CHANNEL_3:    Channel 3
 *
 * @retval      None
 *
 * @note
 */
void TMR2_EnableOutputCompareBuffer(uint8_t channel)
{
    if(channel & TMR2_CHANNEL_1)
    {
        TMR2->CH1OC_B.OCBEN = BIT_SET;
    }

    if(channel & TMR2_CHANNEL_2)
    {
        TMR2->CH2OC_B.OCBEN = BIT_SET;
    }

    if(channel & TMR2_CHANNEL_3)
    {
        TMR2->CH3OC_B.OCBEN = BIT_SET;
    }
}

/*!
 * @brief       Disable Specified Channel output compare buffer(preload)
 *
 * @param       tmr:        Timer peripheral. It can be TMR1 or TMR1A
 *
 * @param       channel:    Timer Channel
 *                          The Parameter can be combination of the following values:
 *                          @arg TMR2_CHANNEL_1:    Channel 1
 *                          @arg TMR2_CHANNEL_2:    Channel 2
 *                          @arg TMR2_CHANNEL_3:    Channel 3
 *
 * @retval      None
 *
 * @note
 */
void TMR2_DisableOutputCompareBuffer(uint8_t channel)
{
    if(channel & TMR2_CHANNEL_1)
    {
        TMR2->CH1OC_B.OCBEN = BIT_RESET;
    }

    if(channel & TMR2_CHANNEL_2)
    {
        TMR2->CH2OC_B.OCBEN = BIT_RESET;
    }

    if(channel & TMR2_CHANNEL_3)
    {
        TMR2->CH3OC_B.OCBEN = BIT_RESET;
    }
}

/*!
 * @brief       Generating Event by software
 *
 * @param       event:  Event source specified
 *              This parameter can be any combination of the following values:
 *              @arg TMR2_EVENT_UPDATE:     Update evnet
 *              @arg TMR2_EVENT_CH1CC:      Channel 1 Compare/Capture evnet
 *              @arg TMR2_EVENT_CH2CC:      Channel 2 Compare/Capture evnet
 *              @arg TMR2_EVENT_CH3CC:      Channel 3 Compare/Capture evnet
 *              @arg TMR2_EVENT_TRIGGER:    Trigger evnet
 *
 * @retval      None
 *
 * @note
 */
void TMR2_GenerateEvent(uint8_t event)
{
    TMR2->SCEG = (uint32_t)event;
}

/*!
 * @brief       Specified Channel output compare polarity configuration
 *
 * @param       channel:    Timer Channel
 *                          The Parameter can be combination of the following values:
 *                          @arg TMR2_CHANNEL_1:    Channel 1
 *                          @arg TMR2_CHANNEL_2:    Channel 2
 *                          @arg TMR2_CHANNEL_3:    Channel 3
 *
 * @param       polarity:   Specifies the polarity
 *
 * @retval      None
 *
 * @note
 */
void TMR2_ConfigOutputComparePolarity(uint8_t channel, TMR2_OC_POLARITY_T polarity)
{
    if(channel & TMR2_CHANNEL_1)
    {
        TMR2->CHCTRL1_B.CH1CCP = polarity;
    }

    if(channel & TMR2_CHANNEL_2)
    {
        TMR2->CHCTRL1_B.CH2CCP = polarity;
    }

    if(channel & TMR2_CHANNEL_3)
    {
        TMR2->CHCTRL2_B.CH3CCP = polarity;
    }
}

/*!
 * @brief       Enable specified Channel Compare/Capture output
 *
 * @param       channel:    Timer Channel
 *                          The Parameter can be combination of the following values:
 *                          @arg TMR2_CHANNEL_1:    Channel 1
 *                          @arg TMR2_CHANNEL_2:    Channel 2
 *                          @arg TMR2_CHANNEL_3:    Channel 3
 *
 * @retval      None
 *
 * @note
 */
void TMR2_EnableCompareCapture( uint8_t channel)
{
    if(channel & TMR2_CHANNEL_1)
    {
        TMR2->CHCTRL1_B.CH1CCEN = ENABLE;
    }

    if(channel & TMR2_CHANNEL_2)
    {
        TMR2->CHCTRL1_B.CH2CCEN = ENABLE;
    }

    if(channel & TMR2_CHANNEL_3)
    {
        TMR2->CHCTRL2_B.CH3CCEN = ENABLE;
    }
}

/*!
 * @brief       Disable specified Channel Compare/Capture output
 *
 * @param       channel:    Timer Channel
 *                          The Parameter can be combination of the following values:
 *                          @arg TMR2_CHANNEL_1:    Channel 1
 *                          @arg TMR2_CHANNEL_2:    Channel 2
 *                          @arg TMR2_CHANNEL_3:    Channel 3
 *
 * @retval      None
 *
 * @note
 */
void TMR2_DisableCompareCapture(uint8_t channel)
{
    if(channel & TMR2_CHANNEL_1)
    {
        TMR2->CHCTRL1_B.CH1CCEN = DISABLE;
    }

    if(channel & TMR2_CHANNEL_2)
    {
        TMR2->CHCTRL1_B.CH2CCEN = DISABLE;
    }

    if(channel & TMR2_CHANNEL_3)
    {
        TMR2->CHCTRL2_B.CH3CCEN = DISABLE;
    }
}

/*!
 * @brief       Set counter register value
 *
 * @param       count:  specifies the counter register new value
 *
 * @retval      None
 *
 * @note
 */
void TMR2_SetCounter(uint16_t count)
{
    TMR2->CNT1 = (uint32_t)((count >> 8) & 0xff);
    TMR2->CNT0 = (uint32_t)(count & 0xff);
}

/*!
 * @brief       Update source configuration
 *
 * @param       source: Specifies the update source.
 *
 * @retval      None
 *
 * @note
 */
void TMR2_ConfigUpdate(TMR2_UPDATE_SOURCE_T source)
{
    TMR2->CTRL1_B.UES = source & 0x01;
    TMR2->CTRL1_B.NGUE = (source >> 4) & 0x01;
}

/*!
 * @brief       Enable Single pulse mode
 *
 * @retval      None
 *
 * @note
 */
void TMR2_EnableSinglePulseMode(void)
{
    TMR2->CTRL1_B.SPMEN = BIT_SET;
}

/*!
 * @brief       Disable Single pulse mode
 *
 * @retval      None
 *
 * @note
 */
void TMR2_DisableSinglePulseMode(void)
{
    TMR2->CTRL1_B.SPMEN = BIT_RESET;
}

/*!
 * @brief       Set Auto-Reload register value
 *
 * @param       reload: specifies the Auto-Reload register new value
 *
 * @retval      None
 *
 * @note
 */
void TMR2_SetAutoReloadVaue(uint16_t reload)
{
    TMR2->AUTORLD1 = (uint32_t)((reload >> 8) & 0xff);
    TMR2->AUTORLD0 = (uint32_t)(reload & 0xff);
}

/*!
 * @brief       Set specified Channel Compare/Capture register value
 *
 * @param       channel:    Timer Channel
 *                          The Parameter can be combination of the following values:
 *                          @arg TMR2_CHANNEL_1:    Channel 1
 *                          @arg TMR2_CHANNEL_2:    Channel 2
 *                          @arg TMR2_CHANNEL_3:    Channel 3
 *
 * @param       compare:    specifies the Channel Capture Compare register value
 *
 * @retval      None
 *
 * @note
 */
void TMR2_SetCompareCapture(uint8_t channel, uint16_t compare)
{
    if(channel & TMR2_CHANNEL_1)
    {
        TMR2->CH1CC1 = (uint32_t)((compare >> 8) & 0xff);
        TMR2->CH1CC0 = (uint32_t)(compare & 0xff);
    }

    if(channel & TMR2_CHANNEL_2)
    {
        TMR2->CH2CC1 = (uint32_t)((compare >> 8) & 0xff);
        TMR2->CH2CC0 = (uint32_t)(compare & 0xff);
    }

    if(channel & TMR2_CHANNEL_3)
    {
        TMR2->CH3CC1 = (uint32_t)((compare >> 8) & 0xff);
        TMR2->CH3CC0 = (uint32_t)(compare & 0xff);
    }
}

/*!
 * @brief       Read Channel 1 Capture Compare register value
 *
 * @param       None
 *
 * @retval      Channel 1 Capture Compare register value
 *
 * @note
 */
uint16_t TMR2_ReadCapture1(void)
{
    uint16_t capture = 0;

    capture = (uint16_t)TMR2->CH1CC1;
    capture <<= 8;
    capture |= (uint16_t)TMR2->CH1CC0;

    return capture;
}

/*!
 * @brief       Read Channel 2 Capture Compare register value
 *
 * @param       None
 *
 * @retval      Channel 2 Capture Compare register value
 *
 * @note
 */
uint16_t TMR2_ReadCapture2(void)
{
    uint16_t capture = 0;

    capture = (uint16_t)TMR2->CH2CC1;
    capture <<= 8;
    capture |= (uint16_t)TMR2->CH2CC0;

    return capture;
}

/*!
 * @brief       Read Channel 3 Capture Compare register value
 *
 * @param       None
 *
 * @retval      Channel 3 Capture Compare register value
 *
 * @note
 */
uint16_t TMR2_ReadCapture3(void)
{
    uint16_t capture = 0;

    capture = (uint16_t)TMR2->CH3CC1;
    capture <<= 8;
    capture |= (uint16_t)TMR2->CH3CC0;

    return capture;
}

/*!
 * @brief       Read specified Channel Compare/Capture register value
 *
 * @param       channel:    Timer Channel
 *                          The Parameter can be one of the following values:
 *                          @arg TMR2_CHANNEL_1:    Channel 1
 *                          @arg TMR2_CHANNEL_2:    Channel 2
 *                          @arg TMR2_CHANNEL_3:    Channel 3
 *
 * @retval      Capture Compare register value
 *
 * @note
 */
uint16_t TMR2_ReadCompareCapture(TMR2_CHANNEL_T channel)
{
    if(channel & TMR2_CHANNEL_1)
    {
        return TMR2_ReadCapture1();
    }

