tieutuanbao/mcu_xlibs/arch/arm/geehy/apm32f003x4x6/libs/source/apm32f00x_tmr2.c
    else if(channel & TMR2_CHANNEL_2)
    {
        return TMR2_ReadCapture2();
    }

    else
    {
        return TMR2_ReadCapture3();
    }
}

/*!
 * @brief       Set specified Channel Input Capture divider
 *
 * @param       channel:    Timer Channel
 *                          The Parameter can be combination of the following values:
 *                          @arg TMR2_CHANNEL_1:    Channel 1
 *                          @arg TMR2_CHANNEL_2:    Channel 2
 *                          @arg TMR2_CHANNEL_3:    Channel 3
 *
 * @param       divider:    specifies the channel Input Capture divider
 *
 * @retval      None
 *
 * @note
 */
void TMR2_SetInputCaptureDivider(uint8_t channel, TMR2_IC_DIV_T divider)
{
    if(channel & TMR2_CHANNEL_1)
    {
        TMR2->CH1IC_B.IC1PSC = divider;
    }

    if(channel & TMR2_CHANNEL_2)
    {
        TMR2->CH2IC_B.IC2PSC= divider;
    }

    if(channel & TMR2_CHANNEL_3)
    {
        TMR2->CH3IC_B.IC3PSC = divider;
    }
}

/*!
 * @brief       Read counter register value
 *
 * @param       None
 *
 * @retval      Counter register value
 *
 * @note
 */
uint16_t TMR2_ReadCounter(void)
{
    uint16_t capture = 0;

    capture = (uint16_t)TMR2->CNT1;
    capture <<= 8;
    capture |= (uint16_t)TMR2->CNT0;

    return capture;
}

/*!
 * @brief       Read Divider register value
 *
 * @param       None
 *
 * @retval      Divider register value
 *
 * @note
 */
uint8_t TMR2_ReadDivider(void)
{
    return(uint8_t)TMR2->PSC;
}

/*!
 * @brief       Read specifies the flag
 *
 * @param       flag:   specifies the flag
 *                      The parameter can be any combination of the following values:
 *                      @arg TMR2_FLAG_UPDATE:      update flag
 *                      @arg TMR2_FLAG_CH1CC:       Channel 1 Compare/Capture flag
 *                      @arg TMR2_FLAG_CH2CC:       Channel 2 Compare/Capture
 *                      @arg TMR2_FLAG_CH3CC:       Channel 3 Compare/Capture
 *                      @arg TMR2_FLAG_TRIGGER:     Trigger flag
 *                      @arg TMR2_FLAG_CH1RCF:      Channel 1 repetition capture flag
 *                      @arg TMR2_FLAG_CH2RCF:      Channel 2 repetition capture flag
 *                      @arg TMR2_FLAG_CH3RCF:      Channel 3 repetition capture flag
 *
 * @retval      specifies the flag status.It can be SET or RESET
 *
 * @note
 */
uint8_t TMR2_ReadStatusFlag(uint16_t flag)
{
    uint8_t flag1;
    uint8_t flag2;
    uint8_t status1 = 0;
    uint8_t status2 = 0;

    flag1 = (uint8_t)(flag & 0XFF);
    flag2 = (uint8_t)((flag >> 8) & 0xff);

    if(flag1)
    {
        status1 = (uint8_t)(TMR2->STS1 & flag1);
    }

    if(flag2)
    {
        status2 = (uint8_t)(TMR2->STS2 & flag2);
    }

    if((flag1 == status1) && (flag2 == status2))
    {
        return SET;
    }

    return RESET;
}

/*!
 * @brief       Clear specifies the flag
 *
 * @param       flag:   specifies the flag
 *                      The parameter can be any combination of the following values:
 *                      @arg TMR2_FLAG_UPDATE:      update flag
 *                      @arg TMR2_FLAG_CH1CC:       Channel 1 Compare/Capture flag
 *                      @arg TMR2_FLAG_CH2CC:       Channel 2 Compare/Capture
 *                      @arg TMR2_FLAG_CH3CC:       Channel 3 Compare/Capture
 *                      @arg TMR2_FLAG_TRIGGER:     Trigger flag
 *                      @arg TMR2_FLAG_CH1RCF:      Channel 1 repetition capture flag
 *                      @arg TMR2_FLAG_CH2RCF:      Channel 2 repetition capture flag
 *                      @arg TMR2_FLAG_CH3RCF:      Channel 3 repetition capture flag
 *
 * @retval      specifies the flag status.It can be SET or RESET
 *
 * @note
 */
void TMR2_ClearStatusFlag(uint16_t flag)
{
    uint8_t flag1;
    uint8_t flag2;

    flag1 = (uint8_t)(flag & 0XFF);
    flag2 = (uint8_t)((flag >> 8) & 0xff);

    if(flag1)
    {
        TMR2->STS1 &= (uint32_t)~flag1;
    }

    if(flag2)
    {
        TMR2->STS2 &= (uint32_t)~flag2;
    }
}

/*!
 * @brief       Read interrupt flag
 *
 * @param       interrupt:  Interrupt source.
 *                          This parameter can be any combination of the following values:
 *                          @arg TMR2_INT_UPDATE:   Update interrupt
 *                          @arg TMR2_INT_CH1CC:    Channel 1 Compare/Capture interrupt
 *                          @arg TMR2_INT_CH2CC:    Channel 2 Compare/Capture interrupt
 *                          @arg TMR2_INT_CH3CC:    Channel 3 Compare/Capture interrupt
 *                          @arg TMR2_INT_TRIGGER:  Trigger interrupt
 *
 * @retval      Specifies Interrupt source flag status.It Can be SET or RESET
 *
 * @note
 */
uint8_t TMR2_ReadIntFlag(uint8_t interrupt)
{
    uint8_t intEnable;
    uint8_t intStatus;

    intStatus = (uint8_t)(TMR2->STS1 & interrupt);
    intEnable = (uint8_t)(TMR2->INTCTRL & interrupt);

    if((intStatus == interrupt) && (intEnable == interrupt))
    {
        return SET;
    }

    return RESET;
}

/*!
 * @brief       Clear interrupt flag
 *
 * @param       interrupt:  Interrupt source.
 *                          This parameter can be any combination of the following values:
 *                          @arg TMR2_INT_UPDATE:   Update interrupt
 *                          @arg TMR2_INT_CH1CC:    Channel 1 Compare/Capture interrupt
 *                          @arg TMR2_INT_CH2CC:    Channel 2 Compare/Capture interrupt
 *                          @arg TMR2_INT_CH3CC:    Channel 3 Compare/Capture interrupt
 *                          @arg TMR2_INT_TRIGGER:  Trigger interrupt
 *
 * @retval      None
 *
 * @note
 */
void TMR2_ClearIntFlag(uint8_t interrupt)
{
    TMR2->STS1 &= (uint32_t)~interrupt;
}

/*!
 * @brief       Slave mode Configuration
 *
 * @param       mode:   Specifies the slave mode
 *
 * @retval      None
 *
 * @note
 */
void TMR2_ConfigSlaveMode(TMR2_SLAVE_MODE_T mode)
{
    TMR2->SMC_B.SMFC = mode;
}

/*!
 * @brief       Master mode Configuration
 *
 * @param       mode:   Specifies the master mode
 *
 * @retval      None
 *
 * @note
 */
void TMR2_ConfigMasterMode(TMR2_MASTER_MODE_T mode)
{
    TMR2->CTRL2_B.MMFC = mode;
}

/*!
 * @brief       Enable master mode
 *
 * @param       None
 *
 * @retval      None
 *
 * @note
 */
void TMR2_EnableMasterMode(void)
{
    TMR2->SMC_B.MSMEN = BIT_SET;
}

/*!
 * @brief       Disable master mode
 *
 * @param       None
 *
 * @retval      None
 *
 * @note
 */
void TMR2_DisableMasterMode(void)
{
    TMR2->SMC_B.MSMEN = BIT_RESET;
}

/**@} end of group TMR2_Fuctions*/
/**@} end of group TMR2_Driver */
/**@} end of group Peripherals_Library*/
